app/views/lists/_list.html.erb

SELECT "quotes".* FROM "quotes" INNER JOIN "lists_quotes" ON "quotes"."id" = "lists_quotes"."quote_id" WHERE "lists_quotes"."list_id" = $1  [["list_id", 16]]
---
  <span> | Quote list</span>
  <% if list.quotes.present? %>