app/views/lists/show.html.erb


<% @list.quotes.each do |quote| %>
---
SELECT "quotes".* FROM "quotes" INNER JOIN "lists_quotes" ON "quotes"."id" = "lists_quotes"."quote_id" WHERE "lists_quotes"."list_id" = $1  [["list_id", 16]]