app/views/quotes/index.html.erb

<div id = pagination >
  <% for i in 0..Quote.all.count/5 %>
---
SELECT "quotes".* FROM "quotes"
SELECT COUNT(*) FROM "quotes"