app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "desktop list"], ["user_id", 2], ["created_at", 2016-09-16 15:08:15 UTC], ["updated_at", 2016-09-16 15:08:15 UTC]]
---
  def create
    @list = List.new(list_params)
    @list.user_id = current_user[:id]
    respond_to do |format|
      if @list.save

UPDATE "lists" SET "name" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["name", "2 desktop list ja"], ["updated_at", 2016-09-16 15:33:25 UTC], ["id", 9]]
---
  def update
    respond_to do |format|
      list_params[:user_id] = current_user[:id]
      if @list.update(list_params)

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_list_quote
      @list = List.find(params[:list_id])
      @quote = Quote.find(params[:id])