app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
SELECT COUNT(*) FROM "quotes"
---
  def index
    @quotes = Quote.all.page(params[:page]).per(10)

INSERT INTO "quotes" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Pepe quote's"], ["content", "yeiiiiiiiiiiiii"], ["created_at", 2016-09-15 12:35:01 UTC], ["updated_at", 2016-09-15 12:35:01 UTC], ["user_id", 5]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def create
    @quote = Quote.new(quote_params)
    @quote.user_id = current_user[:id]
    @quote.lists<<List.find(params[:quote][:list_ids]) if params[:quote][:list_ids].present?

UPDATE "quotes" SET "content" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["content", "3ewsfg"], ["updated_at", 2016-09-19 10:38:20 UTC], ["id", 7]]
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "lists".* FROM "lists" INNER JOIN "lists_quotes" ON "lists"."id" = "lists_quotes"."list_id" WHERE "lists_quotes"."quote_id" = $1  [["quote_id", 8]]
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)
        @quote.lists<<List.find(params[:quote][:list_ids])

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_quote_list
      @quote = Quote.find(params[:id])
      if params[:quote][:list_ids].present?
        @list = List.find(params[:quote][:list_ids])