app/controllers/quotes_controller.rb

  def index
    @quotes = Quote.all.offset(@pag.to_i).limit(5)
---
SELECT  "quotes".* FROM "quotes" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 5]]